; ==================================================================================================
; Title:      OA_Tools_SP.lng
; Author:     G. Friedrich
; Version:    C.1.0
; Purpose:    ObjAsm OAT_App spanish language resource file.
; Notes:      Version C.1.0, October 2017
;               - First release.
; ==================================================================================================


STRINGTABLE
LANGUAGE LANG_SPANISH, SUBLANG_SPANISH
BEGIN
  IDLANG_SPANISH + IDS_APPLICATION,             "&Aplicación|Comandos de aplicación"
  IDLANG_SPANISH + IDS_APPL_SETUP,              "&Configuración...~F2|Configurar la aplicación"
  IDLANG_SPANISH + IDS_LANGUAGE,                "&Idioma|Seleccionar del idioma de la aplicación"
  IDLANG_SPANISH + IDS_LANG_ENGLISH,            "&English|English language"
  IDLANG_SPANISH + IDS_LANG_GERMAN,             "&Deutsch|Deutsche Sprache"
  IDLANG_SPANISH + IDS_LANG_SPANISH,            "&Español|Lenguage español"
  IDLANG_SPANISH + IDS_LANG_CHINESE,            "中文|中文"
  IDLANG_SPANISH + IDS_APPL_EXIT,               "&Salir...~Alt+F4|Finalizar la aplicación"

  IDLANG_SPANISH + IDS_EDIT,                    "&Editar|Comandos de edición"
  IDLANG_SPANISH + IDS_EDIT_CUT,                XMENU_CAT_RES(C&ortar~Ctrl+X, IDS_HINT_CUT)
  IDLANG_SPANISH + IDS_EDIT_COPY,               XMENU_CAT_RES(&Copiar~Ctrl+C, IDS_HINT_COPY)
  IDLANG_SPANISH + IDS_EDIT_PASTE,              XMENU_CAT_RES(&Insertar~Ctrl+V, IDS_HINT_PASTE)
  IDLANG_SPANISH + IDS_EDIT_DELETE,             XMENU_CAT_RES(&Borrar~Del, IDS_HINT_DELETE)
  IDLANG_SPANISH + IDS_EDIT_SELECT_ALL,         XMENU_CAT_RES(&Seleccionar todo~Ctrl+A, IDS_HINT_SELECT_ALL)

  IDLANG_SPANISH + IDS_OPEN_EDITOR,             XMENU_CAT_RES(&Abrir editor externo, IDS_HINT_OPEN_EDITOR)
  IDLANG_SPANISH + IDS_COPY_FILENAME,           XMENU_CAT_RES(Copiar &nombre del archivo, IDS_HINT_COPY_FILENAME)
  IDLANG_SPANISH + IDS_CHECK_AGAIN,             XMENU_CAT_RES(&Verificar nuevamente, IDS_HINT_CHECK_AGAIN)

  IDLANG_SPANISH + IDS_MENU_CHECK,              "&Verificación|Verificaciones del código fuente"
  IDLANG_SPANISH + IDS_MENU_CHECK_MTD,          "Método"
  IDLANG_SPANISH + IDS_MENU_CHECK_MTD_REG,      "&Registros...|Verificar el uso de los registros dentro de un método"
  IDLANG_SPANISH + IDS_MENU_CHECK_MTD_ARG,      "&Argumentos...|Verificar el uso de los argumentos dentro de un método"
  IDLANG_SPANISH + IDS_MENU_CHECK_MTD_LOC,      "&Locals...|Verificar el uso de las variables locales dentro de un método"
  IDLANG_SPANISH + IDS_MENU_CHECK_MTD_ALL,      "&Todas...~F5|Ejecutar todas las verificaciones de método"
  IDLANG_SPANISH + IDS_MENU_CHECK_PRC,          "Procedimento"
  IDLANG_SPANISH + IDS_MENU_CHECK_PRC_REG,      "R&egistros...|Verificar el uso de los registros dentro de un procedimento"
  IDLANG_SPANISH + IDS_MENU_CHECK_PRC_ARG,      "Ar&gumentos...|Verificar el uso de los argumentos dentro de un procedimento"
  IDLANG_SPANISH + IDS_MENU_CHECK_PRC_LOC,      "L&ocales...|Verificar el uso de las variables locales dentro de un procedimento"
  IDLANG_SPANISH + IDS_MENU_CHECK_PRC_ALL,      "T&odas...~Ctrl+F5|Ejecutar todas las verificaciones de procedimento"
  IDLANG_SPANISH + IDS_MENU_CHECK_MAC,          "Macro"
  IDLANG_SPANISH + IDS_MENU_CHECK_MAC_ARG,      "Arg&umentos...|Verificar el uso de los argumentos dentro de un macro"
  IDLANG_SPANISH + IDS_MENU_CHECK_MAC_LOC,      "Lo&cales...|Verificar el uso de las variables locales dentro de un macro"
  IDLANG_SPANISH + IDS_MENU_CHECK_MAC_ALL,      "To&das...~Alt+F5|Ejecutar todas las verificaciones de macros"

  IDLANG_SPANISH + IDS_TOOL,                    "&Herramientas|Herramientas externas útiles"

  IDLANG_SPANISH + IDS_WINDOW,                  "&Ventanas|Comandos de ventana"
  IDLANG_SPANISH + IDS_WINDOW_CASCADE,          XMENU_CAT_RES(&Cascada~Shift+F5, IDS_HINT_CASCADE)
  IDLANG_SPANISH + IDS_WINDOW_TILE_HOR,         XMENU_CAT_RES(&Mosaico horizonatal, IDS_HINT_TILE_HOR)
  IDLANG_SPANISH + IDS_WINDOW_TILE_VER,         XMENU_CAT_RES(&Mosaico vertical~Shift+F4, IDS_HINT_TILE_VER)
  IDLANG_SPANISH + IDS_WINDOW_ARRANGE,          XMENU_CAT_RES(&Organizar íconos, IDS_HINT_ARRANGE)
  IDLANG_SPANISH + IDS_WINDOW_NEXT,             XMENU_CAT_RES(&Siguiente~Ctrl+F6, IDS_HINT_NEXT)
  IDLANG_SPANISH + IDS_WINDOW_PREV,             XMENU_CAT_RES(&Previa~Ctrl+Shift+F6, IDS_HINT_PREV)
  IDLANG_SPANISH + IDS_WINDOW_CLOSE,            XMENU_CAT_RES(C&errar la ventana activa~Ctrl+F4, IDS_HINT_CLOSE)
  IDLANG_SPANISH + IDS_WINDOW_CLOSE_ALL,        XMENU_CAT_RES(Cerrar &todas las ventanas, IDS_HINT_CLOSE)

  IDLANG_SPANISH + IDS_HELP,                    "&Ayuda|Comandos de ayuda"
  IDLANG_SPANISH + IDS_HELP_SYSINFO,            "Información del systema...|Mostrar información del sistema"
  IDLANG_SPANISH + IDS_HELP_HELP,               "A&yuda sobre esta aplicación...~F1|Ejecutar el sistema de ayuda de esta aplicación"
  IDLANG_SPANISH + IDS_HELP_ABOUT,              "&Acerca...~Shift+F1|Muestrar información sobre esta aplicación"

  IDLANG_SPANISH + IDS_HINT_CUT,                "Cortar la selección y colocarla en el portapapeles"
  IDLANG_SPANISH + IDS_HINT_COPY,               "Copiar la selección y colocarla en el portapapeles"
  IDLANG_SPANISH + IDS_HINT_PASTE,              "Insertar el contenido del portapapeles"
  IDLANG_SPANISH + IDS_HINT_DELETE,             "Borrar la selección"
  IDLANG_SPANISH + IDS_HINT_SELECT_ALL,         "Seleccionar todo el contenido"

  IDLANG_SPANISH + IDS_HINT_CASCADE,            "Ordenar todas las ventanas en cascada"
  IDLANG_SPANISH + IDS_HINT_TILE_HOR,           "Ordenar en forma de mosaico horizontal"
  IDLANG_SPANISH + IDS_HINT_TILE_VER,           "Ordenar en forma de mosaico vertical"
  IDLANG_SPANISH + IDS_HINT_ARRANGE,            "Ordenar todos los íconos"
  IDLANG_SPANISH + IDS_HINT_NEXT,               "Mover el foco a la ventana siguiente"
  IDLANG_SPANISH + IDS_HINT_PREV,               "Mover el foco a la ventana previa"
  IDLANG_SPANISH + IDS_HINT_CLOSE,              "Cerrar la ventana activa"
  IDLANG_SPANISH + IDS_HINT_CLOSE_ALL,          "Cerrar todas las ventanas"

  IDLANG_SPANISH + IDS_HINT_OPEN_EDITOR,        "Abrir el editor externo"
  IDLANG_SPANISH + IDS_HINT_COPY_FILENAME,      "Copiar el nombre del archivo"
  IDLANG_SPANISH + IDS_HINT_CHECK_AGAIN,        "Efectur nuevamente las verificaciones"

  IDLANG_SPANISH + IDS_HINT_ZOOM_IN,            "Agrandar"
  IDLANG_SPANISH + IDS_HINT_ZOOM_OUT,           "Achicar"

  IDLANG_SPANISH + IDS_WORKING,                 "Trabajando"
  IDLANG_SPANISH + IDS_CHECK_REG_READY,         "Verificación del uso de los registros completa"
  IDLANG_SPANISH + IDS_CHECK_LOC_READY,         "Verificación de las variables locales completa"
  IDLANG_SPANISH + IDS_CHECK_ARG_READY,         "Verificación de los argumentos completa"
  IDLANG_SPANISH + IDS_FILE_EMPTY,              "El archivo está vacio!"
  IDLANG_SPANISH + IDS_FILE_OPEN_ERROR,         "El archivo no puede ser abierto!"

  IDLANG_SPANISH + IDS_SELECT_FILE,             "Seleccione un archivo..."
  IDLANG_SPANISH + IDS_SELECT_EDITOR,           "Seleccione un editor externo..."
  IDLANG_SPANISH + IDS_SELECT_TOOL,             "Seleccione una herramienta..."
  IDLANG_SPANISH + IDS_INTERNAL_FAILURE,        "Error interno del programa!"

  IDLANG_SPANISH + IDS_DLG_EXIT_CAPTION,        "ObjAsm Tools salida"
  IDLANG_SPANISH + IDS_DLG_EXIT_QUESTION,       "Está Usted seguro que desea abandonar esta aplicación?"
  IDLANG_SPANISH + IDS_DLG_EXIT_YES,            "&Sí"
  IDLANG_SPANISH + IDS_DLG_EXIT_NO,             "&No"

  IDLANG_SPANISH + IDS_TAB1_MAIN,               "&General   "
  IDLANG_SPANISH + IDS_TAB1_APPLICATION,        "Aplicatión"
  IDLANG_SPANISH + IDS_TAB1_EXTERNAL_EDITOR,    "&Editor externo:"
  IDLANG_SPANISH + IDS_TAB1_LINE_TERMINATOR,    "Teminación de linea:"
  IDLANG_SPANISH + IDS_TAB1_WINDOW,             "Ventana"
  IDLANG_SPANISH + IDS_TAB1_ZOOM_FACTOR,        "&Factor de zoom:"
  IDLANG_SPANISH + IDS_TAB1_FONTFACE_NAME,      "Tipo de &letra:"
  IDLANG_SPANISH + IDS_TAB1_FONT_SIZE,          "Ta&maño:"
  IDLANG_SPANISH + IDS_TAB1_CHECKS,             "Verificaciones"
  IDLANG_SPANISH + IDS_TAB1_CLOSE_NO_FINDINGS,  "Cerrar sin &hallazgos"
  IDLANG_SPANISH + IDS_TAB1_USE_ANNOTATIONS,    "&Utilizar -annotations-"
  IDLANG_SPANISH + IDS_TAB1_MIXED,              "&Ambos"

  IDLANG_SPANISH + IDS_TAB2_TOOLS,              "&Herramientas   "
  IDLANG_SPANISH + IDS_TAB2_TOOL,               "Her."
  IDLANG_SPANISH + IDS_TAB2_NAME,               "Nombre"
  IDLANG_SPANISH + IDS_TAB2_COMMAND,            "Commando"
  IDLANG_SPANISH + IDS_TAB2_NOTE,               "Nota: agregar '$' al comando para pasar el nombre del archivo."

  IDLANG_SPANISH + IDS_TAB3_COLORS,             "&Colores  "
  IDLANG_SPANISH + IDS_TAB3_COLOR_NOTIF,        "&Notificación"
  IDLANG_SPANISH + IDS_TAB3_COLOR_COMMENT,      "&Información"
  IDLANG_SPANISH + IDS_TAB3_COLOR_FAILIURE,     "Fa&lla del programa"
  IDLANG_SPANISH + IDS_TAB3_COLOR_BKGROUND,     "&Fondo"
  IDLANG_SPANISH + IDS_TAB3_COLOR_REG_ERROR,    "&Error de registro"
  IDLANG_SPANISH + IDS_TAB3_COLOR_REG_WARNING,  "&Advertencia de registro"
  IDLANG_SPANISH + IDS_TAB3_COLOR_ARG_WARNING,  "&Advertencia de argumento"
  IDLANG_SPANISH + IDS_TAB3_COLOR_LOC_WARNING,  "&Advertencia de var. local"
  IDLANG_SPANISH + IDS_TAB3_NOTE,               "Nota: modificaciones toman efecto sobre ventanas nuevas."

  IDLANG_SPANISH + IDS_SETUP,                   "Configuración"
  IDLANG_SPANISH + IDS_CANCEL,                  "&Cancelar"

  IDLANG_SPANISH + IDS_CODEBLOCK_NAME,          "  Bloque de código: "
  IDLANG_SPANISH + IDS_REGISTERS,               "  Registro(s):     "
  IDLANG_SPANISH + IDS_ARGUMENTS,               "  Argumento(s):    "
  IDLANG_SPANISH + IDS_LOCALS,                  "  Local(es):       "
  IDLANG_SPANISH + IDS_REG_WARNING,             "ADVERTENCIA: posible preservación innecesaria de registro(s)"
  IDLANG_SPANISH + IDS_ARG_WARNING,             "ADVERTENCIA: posible(s) argumento(s) sin uso"
  IDLANG_SPANISH + IDS_LOC_WARNING,             "ADVERTENCIA: posible(s) variable(s) local(es) sin uso"
  IDLANG_SPANISH + IDS_REG_ERROR,               "ERROR: posible(s) registro(s) no preservado(s)"

  IDLANG_SPANISH + IDS_SELECTION_FILE_NAME      "Archivo &seleccionado:"
  IDLANG_SPANISH + IDS_SELECTION_OPEN           "&Abrir"
  IDLANG_SPANISH + IDS_SELECTION_FILTER_NAME_0  "Archivos de ensamblador"
  IDLANG_SPANISH + IDS_SELECTION_FILTER_NAME_1  "Archivos de texto"
  IDLANG_SPANISH + IDS_SELECTION_FILTER_NAME_2  "Todos los archivos"

  IDLANG_SPANISH + IDS_ABOUT_CAPTION,           "Acerca de esta aplicación"
  IDLANG_SPANISH + IDS_ABOUT_APPLICATION,       "ObjAsm Tools"
  IDLANG_SPANISH + IDS_ABOUT_VERSION,           "Versión "
  IDLANG_SPANISH + IDS_ABOUT_DESCRIPTION,       "Este programa contine varias herramientas para verificar el código fuente escrito en assembler.\nPor favor lea atentamene el manual de instrucciones."
  IDLANG_SPANISH + IDS_ABOUT_EMAIL,             "ICON_LINK|&Visite nuesta página Web|http://objasm.x10host.com/"
  IDLANG_SPANISH + IDS_ABOUT_HOMEPAGE,          "ICON_MAIL|&Envíenos un Email|mailto:objasm@gmx.net"

  IDLANG_SPANISH + IDS_TOOL_FILTER_NAME_0       "Archivos ejecutables"
  IDLANG_SPANISH + IDS_TOOL_FILTER_NAME_1       "Archivos de batch"
  IDLANG_SPANISH + IDS_TOOL_FILTER_NAME_2       "Archivos de script"
  IDLANG_SPANISH + IDS_TOOL_FILTER_NAME_3       "Todos los archivos"

  IDLANG_SPANISH + ID_MDI_MORE,                 "&Otras ventanas...|Seleccione una ventana"
  IDLANG_SPANISH + ID_MDI_LIST,                 "Lista de ventanas"

  IDLANG_SPANISH + IDS_DROP_CHECK_MTD,          "Verificaciones de métodos"
  IDLANG_SPANISH + IDS_DROP_CHECK_MTD_REG,      "&Registros|Verificar el uso de los registros dentro de un método"
  IDLANG_SPANISH + IDS_DROP_CHECK_MTD_ARG,      "&Argumentos|Verificar el uso de los argumentos dentro de un método"
  IDLANG_SPANISH + IDS_DROP_CHECK_MTD_LOC,      "&Locals|Verificar el uso de las variables locales dentro de un método"
  IDLANG_SPANISH + IDS_DROP_CHECK_MTD_ALL,      "&Todas|Ejecutar todas las verificaciones de método"
  IDLANG_SPANISH + IDS_DROP_CHECK_PRC,          "Verificaciones de procedimentos"
  IDLANG_SPANISH + IDS_DROP_CHECK_PRC_REG,      "R&egistros|Verificar el uso de los registros dentro de un procedimento"
  IDLANG_SPANISH + IDS_DROP_CHECK_PRC_ARG,      "Ar&gumentos|Verificar el uso de los argumentos dentro de un procedimento"
  IDLANG_SPANISH + IDS_DROP_CHECK_PRC_LOC,      "L&ocales|Verificar el uso de las variables locales dentro de un procedimento"
  IDLANG_SPANISH + IDS_DROP_CHECK_PRC_ALL,      "T&odas|Ejecutar todas las verificaciones de procedimento"
  IDLANG_SPANISH + IDS_DROP_CHECK_MAC,          "Verificaciones de macros"
  IDLANG_SPANISH + IDS_DROP_CHECK_MAC_ARG,      "Arg&umentos|Verificar el uso de los argumentos dentro de un macro"
  IDLANG_SPANISH + IDS_DROP_CHECK_MAC_LOC,      "Lo&cales|Verificar el uso de las variables locales dentro de un macro"
  IDLANG_SPANISH + IDS_DROP_CHECK_MAC_ALL,      "To&das|Ejecutar todas las verificaciones de macros"
END
